app/controllers/api/v0/base_controller.rb

SELECT "sobreviventes".* FROM "sobreviventes"
SELECT COUNT(*) FROM "sobreviventes"
---
  def relatorio
    @sobreviventes = Sobrevivente.all

    contaminados = @sobreviventes.select{|s| s.contaminado? }.count

SELECT "sobreviventes".* FROM "sobreviventes"
SELECT COUNT(*) FROM "sobreviventes"
---
  def relatorio_contaminados
    @sobreviventes = Sobrevivente.all
    contaminados = @sobreviventes.select{|s| s.contaminado? }.count

SELECT "sobreviventes".* FROM "sobreviventes"
SELECT COUNT(*) FROM "sobreviventes"
---
  def relatorio_nao_contaminados
    @sobreviventes = Sobrevivente.all
    nao_contaminados = @sobreviventes.select{|s| !s.contaminado? }.count

SELECT "sobreviventes".* FROM "sobreviventes"
---
  def pontos_perdidos
    @sobreviventes = Sobrevivente.all